In [46]:
import pandas as pd 
import numpy as np

In [47]:
"""
Given an integer array nums, return an array answer such that answer[i] is equal to the product of all the elements of nums except nums[i].

The product of any prefix or suffix of nums is guaranteed to fit in a 32-bit integer.

You must write an algorithm that runs in O(n) time and without using the division operation.

 

Example 1:

Input: nums = [1,2,3,4]
Output: [24,12,8,6]
Example 2:

Input: nums = [-1,1,0,-3,3]
Output: [0,0,9,0,0]

"""

nums = [1,2,3,4]
output = 1
answer = []

for i in nums:
    output *= i
    answer.append(output)

answer

[1, 2, 6, 24]

In [48]:
"""
Given an integer array nums and an integer k, return the k most frequent elements. You may return the answer in any order.

Example 1:

Input: nums = [1,1,1,2,2,3], k = 2
Output: [1,2]
Example 2:

Input: nums = [1], k = 1
Output: [1]

"""

nums = [1,1,1,2,2,3,3,3,3]

k = 2

nums_dict = {}

for i in nums:
    nums_dict[i] = nums_dict.get(i, 0) + 1 

elements = sorted(nums_dict.items(), key=lambda x: x[1], reverse=True)

k_top = [top for top, _ in elements[:2]]
k_top

[3, 1]

In [49]:
nums_dict

{1: 3, 2: 2, 3: 4}

In [50]:
"""
Given an array of strings strs, group the 
anagrams
 together. You can return the answer in any order.

 

Example 1:

Input: strs = ["eat","tea","tan","ate","nat","bat"]

Output: [["bat"],["nat","tan"],["ate","eat","tea"]]

Explanation:

There is no string in strs that can be rearranged to form "bat".
The strings "nat" and "tan" are anagrams as they can be rearranged to form each other.
The strings "ate", "eat", and "tea" are anagrams as they can be rearranged to form each other.
Example 2:

Input: strs = [""]

Output: [[""]]

Example 3:

Input: strs = ["a"]

Output: [["a"]]

"""
strs = [""]
strs_dict = {}

i = []
for word in strs:
        key = ''.join(sorted(word))
        if key not in strs_dict:
                strs_dict[key] = []
        strs_dict[key].append(word)

    

list(sorted(strs_dict.values()))

[['']]

In [51]:
j_dict ={}
j = "eat"

j_dict = j

In [52]:
j_dict

'eat'

In [53]:
set("ate")

{'a', 'e', 't'}

In [54]:
"""
Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.

You may assume that each input would have exactly one solution, and you may not use the same element twice.

You can return the answer in any order.

 

Example 1:

Input: nums = [2,7,11,15], target = 9
Output: [0,1]
Explanation: Because nums[0] + nums[1] == 9, we return [0, 1].
Example 2:

Input: nums = [3,2,4], target = 6
Output: [1,2]
Example 3:

Input: nums = [3,3], target = 6
Output: [0,1]
"""

nums = [3,2,4]
target = 6

idx = []
for i in range(len(nums)-1):
    for j in range(1,len(nums)):
        if i != j and nums[i] + nums[j] == target:
            idx.append(i)
            idx.append(j)
    
list(set(idx))

[1, 2]

In [55]:
"""
Given two strings s and t, return true if t is an 
anagram
 of s, and false otherwise.

 

Example 1:

Input: s = "anagram", t = "nagaram"

Output: true

Example 2:

Input: s = "rat", t = "car"

Output: false
"""

s = "anagram"
t = "naaram"

s_dict = {}

for i in s:
    s_dict[i] = s_dict.get(i, 0) + 1 

t_dict = {}

for j in t:
    t_dict[j] = t_dict.get(j, 0) + 1 

s_dict

{'a': 3, 'n': 1, 'g': 1, 'r': 1, 'm': 1}

In [56]:
t_dict == s_dict

False

In [57]:
"""Given an integer array nums, return true if any value appears at least twice in the array, and return false if every element is distinct.
Example 1:

Input: nums = [1,2,3,1]

Output: true

Explanation:

The element 1 occurs at the indices 0 and 3.

Example 2:

Input: nums = [1,2,3,4]

Output: false

Explanation:

All elements are distinct.

Example 3:

Input: nums = [1,1,1,3,3,4,3,2,4,2]

Output: true
"""

nums = [3,1]

nums_list = sorted(list(set(nums)))

if nums_list == sorted(nums):
    print(False)
else:
    print(True)

False

In [58]:
len(nums) != len(set(nums))

False

In [59]:
"""
Given a string s containing just the characters '(', ')', '{', '}', '[' and ']', determine if the input string is valid.

An input string is valid if:

Open brackets must be closed by the same type of brackets.
Open brackets must be closed in the correct order.
Every close bracket has a corresponding open bracket of the same type.
 

Example 1:

Input: s = "()"

Output: true

Example 2:

Input: s = "()[]{}"

Output: true

Example 3:

Input: s = "(]"

Output: false

Example 4:

Input: s = "([])"

Output: true

"""
s = "(())"

stack = []

hash = {')':'(', ']':'[', '}':'{' }


for i in s[::-1]: 
    if i not in hash:
        print(False)
    else:

SyntaxError: incomplete input (2153571029.py, line 47)

In [ ]:
s = "())"
stack = []
for i in s:

    if i in hash:
        if stack and stack[-1] == hash[i]:
            stack.pop()
        else:
            print(False)
    else:
        stack.append(i)

False

In [ ]:
if ')' in hash:
    print(True)

True

In [ ]:
stack

['(', '(']

In [ ]:
if '[' in hash:
    print(True)

In [ ]:
stack = [1,2,3,4]
stack[-1]

4

In [ ]:
"""
Given an integer array nums of length n, you want to create an array ans of length 2n where ans[i] == nums[i] and ans[i + n] == nums[i] for 0 <= i < n (0-indexed).

Specifically, ans is the concatenation of two nums arrays.

Return the array ans.

 

Example 1:

Input: nums = [1,2,1]
Output: [1,2,1,1,2,1]
Explanation: The array ans is formed as follows:
- ans = [nums[0],nums[1],nums[2],nums[0],nums[1],nums[2]]
- ans = [1,2,1,1,2,1]
Example 2:

Input: nums = [1,3,2,1]
Output: [1,3,2,1,1,3,2,1]
Explanation: The array ans is formed as follows:
- ans = [nums[0],nums[1],nums[2],nums[3],nums[0],nums[1],nums[2],nums[3]]
- ans = [1,3,2,1,1,3,2,1]
"""
nums = [1,2,1]

ans = [ ]

for i in range(2):
    for n in nums:
        ans.append(n)

ans

[1, 2, 1, 1, 2, 1]

In [ ]:
"""

Given an integer array nums sorted in non-decreasing order, remove the duplicates in-place such that each unique element appears only once. 
The relative order of the elements should be kept the same. Then return the number of unique elements in nums.

Example 1:

Input: nums = [1,1,2]
Output: 2, nums = [1,2,_]
Explanation: Your function should return k = 2, with the first two elements of nums being 1 and 2 respectively.
It does not matter what you leave beyond the returned k (hence they are underscores).
Example 2:

Input: nums = [0,0,1,1,1,2,2,3,3,4]
Output: 5, nums = [0,1,2,3,4,_,_,_,_,_]
Explanation: Your function should return k = 5, with the first five elements of nums being 0, 1, 2, 3, and 4 respectively.
It does not matter what you leave beyond the returned k (hence they are underscores).
 
"""

nums = [0,0,1,1,1,2,2,3,3,4]

nums

[0, 0, 1, 1, 1, 2, 2, 3, 3, 4]

In [ ]:
i = 0 

for n in range(1, len(nums)):

    if nums[i] != nums[n]:
        i+=1
        nums[i], nums[n] = nums[n], nums[i]

In [ ]:
"""
Given an integer array nums and an integer val, remove all occurrences of val in nums in-place. The order of the elements may be changed. Then return the number of elements in nums which are not equal to val.

Consider the number of elements in nums which are not equal to val be k, to get accepted, you need to do the following things:

Change the array nums such that the first k elements of nums contain the elements which are not equal to val. The remaining elements of nums are not important as well as the size of nums.
Return k.


Example 1:

Input: nums = [3,2,2,3], val = 3
Output: 2, nums = [2,2,_,_]
Explanation: Your function should return k = 2, with the first two elements of nums being 2.
It does not matter what you leave beyond the returned k (hence they are underscores).
Example 2:

Input: nums = [0,1,2,2,3,0,4,2], val = 2
Output: 5, nums = [0,1,4,0,3,_,_,_]
Explanation: Your function should return k = 5, with the first five elements of nums containing 0, 0, 1, 3, and 4.
Note that the five elements can be returned in any order.
It does not matter what you leave beyond the returned k (hence they are underscores).

"""


nums = [0,1,2,2,3,0,4,2]
val = 2

In [ ]:
i = 0 

for n in range(len(nums)):
    if nums[n] != val:
        nums[i] = nums[n]
        i+=1 

i

5

In [ ]:
nums

[0, 1, 3, 0, 4, 0, 4, 2]

In [ ]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [ ]:
"""

Given an integer array nums sorted in non-decreasing order, remove the duplicates in-place such that each unique element appears only once. 
The relative order of the elements should be kept the same. Then return the number of unique elements in nums.

Example 1:
Input: nums = [1,1,2]
Output: 2, nums = [1,2,_]
Explanation: Your function should return k = 2, with the first two elements of nums being 1 and 2 respectively.
It does not matter what you leave beyond the returned k (hence they are underscores).

Example 2:
Input: nums = [0,0,1,1,1,2,2,3,3,4]
Output: 5, nums = [0,1,2,3,4,_,_,_,_,_]
Explanation: Your function should return k = 5, with the first five elements of nums being 0, 1, 2, 3, and 4 respectively.
It does not matter what you leave beyond the returned k (hence they are underscores).

"""

nums =[0,0,1,1,1,2,2,3,3,4]

nums = [nums[i] for i in range(len(nums)-1) if nums[i] != nums[i+1]]

print(nums)

[0, 1, 2, 3]

In [ ]:
nums =[0,0,1,1,1,2,2,3,3,4,4,5,5,5,6,6,6]
i = 0 

for n in range(1, len(nums)):

    if nums[i] != nums[n]:
        i+=1 
        nums[i] = nums[n]
    

i+1

7

In [ ]:
"""
Given an integer array nums and an integer val, remove all occurrences of val in nums in-place. The order of the elements may be changed. Then return the number of elements in nums which are not equal to val.

Consider the number of elements in nums which are not equal to val be k, to get accepted, you need to do the following things:

Change the array nums such that the first k elements of nums contain the elements which are not equal to val. The remaining elements of nums are not important as well as the size of nums.
Return k.

Example 1:

Input: nums = [3,2,2,3], val = 3
Output: 2, nums = [2,2,_,_]
Explanation: Your function should return k = 2, with the first two elements of nums being 2.
It does not matter what you leave beyond the returned k (hence they are underscores).
Example 2:

Input: nums = [0,1,2,2,3,0,4,2], val = 2
Output: 5, nums = [0,1,4,0,3,_,_,_]
Explanation: Your function should return k = 5, with the first five elements of nums containing 0, 0, 1, 3, and 4.
Note that the five elements can be returned in any order.
It does not matter what you leave beyond the returned k (hence they are underscores).

"""

nums =[0,1,2,2,3,0,4,2]

nums = sorted(nums)

i = 0

for n in range(len(nums)):
    if nums[n] != 2:
        nums[i] = nums[n]
        i+=1 

i

5

In [ ]:
"""""
Given an integer array nums and an integer k, return the k most frequent elements. You may return the answer in any order.

 

Example 1:

Input: nums = [1,1,1,2,2,3], k = 2
Output: [1,2]
Example 2:

Input: nums = [1], k = 1
Output: [1]

"""
nums = [1,1,3,3,3,1,1,1,2,2,3,5,5,5,55,5,5,5,5]
k=2

def sort_values(num,k):
    dict_k={}

    for i in num:
        dict_k[i] = dict_k.get(i,0)+1 
    dict_k


    sorted_values = sorted(dict_k.items(), key= lambda x: x[1], reverse=True)

    return [item[0] for item in sorted_values[:k]]

sort_values(nums,2)

[5, 1]

In [ ]:
"""""
Example 1:

Input: strs = ["eat","tea","tan","ate","nat","bat"]

Output: [["bat"],["nat","tan"],["ate","eat","tea"]]

Explanation:

There is no string in strs that can be rearranged to form "bat".
The strings "nat" and "tan" are anagrams as they can be rearranged to form each other.
The strings "ate", "eat", and "tea" are anagrams as they can be rearranged to form each other.
Example 2:

Input: strs = [""]

Output: [[""]]

Example 3:

Input: strs = ["a"]

Output: [["a"]]
"""
strs = ["eat","tea","tan","ate","nat","bat"]


anagram_dict = {}

for word in strs:
    sorted_word = ''.join(sorted(word))
    
    if sorted_word in anagram_dict:
        anagram_dict[sorted_word].append(word)
    
    else:
        anagram_dict[sorted_word] = [word]

print(list(anagram_dict.values()))

[['eat', 'tea', 'ate'], ['tan', 'nat'], ['bat']]

In [ ]:
dict_p = {}

dict_p["name"] =["john"]

dict_p["name"].append("marry")
dict_p

{'name': ['john', 'marry']}

In [ ]:
"""""
Write a solution to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Products table:
+------------+--------+--------+--------+
| product_id | store1 | store2 | store3 |
+------------+--------+--------+--------+
| 0          | 95     | 100    | 105    |
| 1          | 70     | null   | 80     |
+------------+--------+--------+--------+
Output: 
+------------+--------+-------+
| product_id | store  | price |
+------------+--------+-------+
| 0          | store1 | 95    |
| 0          | store2 | 100   |
| 0          | store3 | 105   |
| 1          | store1 | 70    |
| 1          | store3 | 80    |
+------------+--------+-------+
"""""


# Create the Products DataFrame
data = {
    'product_id': [0, 1],
    'store1': [95, 70],
    'store2': [100, None],
    'store3': [105, 80]
}

products = pd.DataFrame(data)

# Display the DataFrame
products

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [ ]:
df_melt = pd.melt(products, id_vars="product_id",var_name="store",value_name="price")
df_melt = df_melt.dropna()
df_melt.sort_values(by="product_id")

   product_id   store  price
0           0  store1   95.0
2           0  store2  100.0
4           0  store3  105.0
1           1  store1   70.0
5           1  store3   80.0

In [ ]:
"""""""""
Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

The result format is in the following example.

 

Example 1:

Input: 
Person table:
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Output: 
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.
"""""

data = {'id': [1, 2, 3],
        'email': ['john@example.com', 'bob@example.com', 'john@example.com']}

df = pd.DataFrame(data)

# Display the DataFrame
df

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [ ]:
df.drop_duplicates(subset="email",keep="first",inplace=True)

In [ ]:
"""""

Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
ActorDirector table:
+-------------+-------------+-------------+
| actor_id    | director_id | timestamp   |
+-------------+-------------+-------------+
| 1           | 1           | 0           |
| 1           | 1           | 1           |
| 1           | 1           | 2           |
| 1           | 2           | 3           |
| 1           | 2           | 4           |
| 2           | 1           | 5           |
| 2           | 1           | 6           |
+-------------+-------------+-------------+
Output: 
+-------------+-------------+
| actor_id    | director_id |
+-------------+-------------+
| 1           | 1           |
+-------------+-------------+
Explanation: The only pair is (1, 1) where they cooperated exactly 3 times.

"""


data = {
    'actor_id': [1, 1, 1, 1, 1, 2, 2],
    'director_id': [1, 1, 1, 2, 2, 1, 1],
    'timestamp': [0, 1, 2, 3, 4, 5, 6]
}

df = pd.DataFrame(data)
df

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [ ]:
counted = df.groupby(["actor_id","director_id"]).size().reset_index(name="count")
counted

   actor_id  director_id  count
0         1            1      3
1         1            2      2
2         2            1      2

In [ ]:
counted = df.groupby(["actor_id","director_id"]).size().apply(lambda x: True if x >= 3 else False).reset_index(name="decision")
counted

   actor_id  director_id  decision
0         1            1      True
1         1            2     False
2         2            1     False

In [ ]:
counted = counted[counted["decision"] == True]
counted[["actor_id","director_id"]]

   actor_id  director_id
0         1            1

In [ ]:

"""""
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| date_id     | date    |
| make_name   | varchar |
| lead_id     | int     |
| partner_id  | int     |
+-------------+---------+
There is no primary key (column with unique values) for this table. It may contain duplicates.
This table contains the date and the name of the product sold and the IDs of the lead and partner it was sold to.
The name consists of only lowercase English letters.
 

For each date_id and make_name, find the number of distinct lead_id's and distinct partner_id's.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
DailySales table:
+-----------+-----------+---------+------------+
| date_id   | make_name | lead_id | partner_id |
+-----------+-----------+---------+------------+
| 2020-12-8 | toyota    | 0       | 1          |
| 2020-12-8 | toyota    | 1       | 0          |
| 2020-12-8 | toyota    | 1       | 2          |
| 2020-12-7 | toyota    | 0       | 2          |
| 2020-12-7 | toyota    | 0       | 1          |
| 2020-12-8 | honda     | 1       | 2          |
| 2020-12-8 | honda     | 2       | 1          |
| 2020-12-7 | honda     | 0       | 1          |
| 2020-12-7 | honda     | 1       | 2          |
| 2020-12-7 | honda     | 2       | 1          |
+-----------+-----------+---------+------------+
Output: 
+-----------+-----------+--------------+-----------------+
| date_id   | make_name | unique_leads | unique_partners |
+-----------+-----------+--------------+-----------------+
| 2020-12-8 | toyota    | 2            | 3               |
| 2020-12-7 | toyota    | 1            | 2               |
| 2020-12-8 | honda     | 2            | 2               |
| 2020-12-7 | honda     | 3            | 2               |
+-----------+-----------+--------------+-----------------+

"""

data = {
    'date_id': ['2020-12-8', '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', 
                '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', '2020-12-7'],
    'make_name': ['toyota', 'toyota', 'toyota', 'toyota', 'toyota', 
                  'honda', 'honda', 'honda', 'honda', 'honda'],
    'lead_id': [0, 1, 1, 0, 0, 
                1, 2, 0, 1, 2],
    'partner_id': [1, 0, 2, 2, 1, 
                   2, 1, 1, 2, 1]
}

df = pd.DataFrame(data)
df

     date_id make_name  lead_id  partner_id
0  2020-12-8    toyota        0           1
1  2020-12-8    toyota        1           0
2  2020-12-8    toyota        1           2
3  2020-12-7    toyota        0           2
4  2020-12-7    toyota        0           1
5  2020-12-8     honda        1           2
6  2020-12-8     honda        2           1
7  2020-12-7     honda        0           1
8  2020-12-7     honda        1           2
9  2020-12-7     honda        2           1

In [ ]:
result = df.groupby(["date_id","make_name"])[["lead_id","partner_id"]].nunique().reset_index()
result

     date_id make_name  lead_id  partner_id
0  2020-12-7     honda        3           2
1  2020-12-7    toyota        1           2
2  2020-12-8     honda        2           2
3  2020-12-8    toyota        2           3

In [ ]:
result = result.rename(columns={'lead_id':'unique_leads','partner_id':'unique_partners'})
result

     date_id make_name  unique_leads  unique_partners
0  2020-12-7     honda             3                2
1  2020-12-7    toyota             1                2
2  2020-12-8     honda             2                2
3  2020-12-8    toyota             2                3

In [ ]:
unique_leads = df.groupby(["date_id","make_name"])["lead_id"].nunique().reset_index(name="unique_leads")
unique_leads

     date_id make_name  unique_leads
0  2020-12-7     honda             3
1  2020-12-7    toyota             1
2  2020-12-8     honda             2
3  2020-12-8    toyota             2

In [ ]:
unique_partners = df.groupby(["date_id","make_name"])["partner_id"].nunique().reset_index(name="unique_partners")
unique_partners

     date_id make_name  unique_partners
0  2020-12-7     honda                2
1  2020-12-7    toyota                2
2  2020-12-8     honda                2
3  2020-12-8    toyota                3

In [ ]:
df_merge = pd.merge(unique_leads,unique_partners, on=["date_id","make_name"])

df_merge

     date_id make_name  unique_leads  unique_partners
0  2020-12-7     honda             3                2
1  2020-12-7    toyota             1                2
2  2020-12-8     honda             2                2
3  2020-12-8    toyota             2                3

In [ ]:
""""""""""
Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

The result format is in the following example.

 

Example 1:

Input: 
Activities table:
+------------+------------+
| sell_date  | product     |
+------------+------------+
| 2020-05-30 | Headphone  |
| 2020-06-01 | Pencil     |
| 2020-06-02 | Mask       |
| 2020-05-30 | Basketball |
| 2020-06-01 | Bible      |
| 2020-06-02 | Mask       |
| 2020-05-30 | T-Shirt    |
+------------+------------+
Output: 
+------------+----------+------------------------------+
| sell_date  | num_sold | products                     |
+------------+----------+------------------------------+
| 2020-05-30 | 3        | Basketball,Headphone,T-shirt |
| 2020-06-01 | 2        | Bible,Pencil                 |
| 2020-06-02 | 1        | Mask                         |
+------------+----------+------------------------------+

"""
data = {
    'sell_date': ['2020-05-30', '2020-06-01', '2020-06-02', '2020-05-30', '2020-06-01', '2020-06-02', '2020-05-30'],
    'product': ['Headphone', 'Pencil', 'Mask', 'Basketball', 'Bible', 'Mask', 'T-Shirt']
}

df = pd.DataFrame(data)
df

    sell_date     product
0  2020-05-30   Headphone
1  2020-06-01      Pencil
2  2020-06-02        Mask
3  2020-05-30  Basketball
4  2020-06-01       Bible
5  2020-06-02        Mask
6  2020-05-30     T-Shirt

In [ ]:
total_sold = df.groupby("sell_date")["product"].apply(lambda row: row.nunique()).reset_index(name="num_sold")
total_sold

    sell_date  num_sold
0  2020-05-30         3
1  2020-06-01         2
2  2020-06-02         1

In [ ]:
total_products = df.groupby("sell_date")["product"].apply(lambda row: ", ".join(sorted(row.unique()))).reset_index(name="products")
total_products

    sell_date                        products
0  2020-05-30  Basketball, Headphone, T-Shirt
1  2020-06-01                   Bible, Pencil
2  2020-06-02                            Mask

In [ ]:
df_merged = pd.merge(total_sold,total_products, on="sell_date")
df_merged

    sell_date  num_sold                        products
0  2020-05-30         3  Basketball, Headphone, T-Shirt
1  2020-06-01         2                   Bible, Pencil
2  2020-06-02         1                            Mask

In [ ]:
"""
+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

The result format is in the following example.
"""

# Create the Employee DataFrame
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

# Create the DataFrame
employee_df = pd.DataFrame(data)
employee_df

   id  salary
0   1     100
1   2     200
2   3     300

In [ ]:
df_filtered = employee_df.sort_values(by="salary")
df_filter = df_filtered["salary"]

df_filter.columns = ["getNthHighestSalary({N})"]
df_filter

0    100
1    200
2    300
Name: salary, dtype: int64

In [ ]:
df_filtered

0    100
1    200
2    300
Name: salary, dtype: int64

In [ ]:
"""""
Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Users table:
+---------+-----------+-------------------------+
| user_id | name      | mail                    |
+---------+-----------+-------------------------+
| 1       | Winston   | winston@leetcode.com    |
| 2       | Jonathan  | jonathanisgreat         |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
| 5       | Marwan    | quarz#2020@leetcode.com |
| 6       | David     | david69@gmail.com       |
| 7       | Shapiro   | .shapo@leetcode.com     |
+---------+-----------+-------------------------+
Output: 
+---------+-----------+-------------------------+
| user_id | name      | mail                    |
+---------+-----------+-------------------------+
| 1       | Winston   | winston@leetcode.com    |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
+---------+-----------+-------------------------+
"""

# Create the DataFrame
data = {
    'user_id': [34, 745, 46, 379, 348, 99, 822, 732, 689, 182, 192],
    'name': ['Aharon', 'Shimon', 'Freida', 'Daniel', 'Menachem', 'Yaffah', 'Refael', 'Yehudit', 'Michael', 'Adam', 'Miriam'],
    'mail': [
        '9.Aharon@leetcode.com', '2019_Shim0n@leetcode.com', 'Freida(A1oA2N7tK@leetcode.com',
        'DanielT7ugi@leetcode.com', 'Menachem$R6CLTItUEi@leetcode.com', 'YaffahsXa@leetcode.com', 
        '_Refael@leetcode.com', 'Yehudit..lk@leetcode.com', 'Michael--4@leetcode.com', 
        'AdamPs@leetcode.com', 'Miriam^GCPhliEUL@leetcode.com'
    ]
}

# Create a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

    user_id      name                              mail
0        34    Aharon             9.Aharon@leetcode.com
1       745    Shimon          2019_Shim0n@leetcode.com
2        46    Freida     Freida(A1oA2N7tK@leetcode.com
3       379    Daniel          DanielT7ugi@leetcode.com
4       348  Menachem  Menachem$R6CLTItUEi@leetcode.com
5        99    Yaffah            YaffahsXa@leetcode.com
6       822    Refael              _Refael@leetcode.com
7       732   Yehudit          Yehudit..lk@leetcode.com
8       689   Michael           Michael--4@leetcode.com
9       182      Adam               AdamPs@leetcode.com
10      192    Miriam     Miriam^GCPhliEUL@leetcode.com

In [ ]:
df_new  = df["mail"].str.contains("@leetcode.com") & (~df["mail"].str.startswith(("-",".","_"))) & (~df["mail"].str.contains("[#^$()^%=+!]",regex=True)) & (~df["mail"].str.match(r"^\d"))
df_new

0     False
1     False
2     False
3      True
4     False
5      True
6     False
7      True
8      True
9      True
10    False
Name: mail, dtype: bool

In [ ]:
users_df[df]

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

In [ ]:
"""""
Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

The result format is in the following example.

 

Example 1:

Input: 
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
Output: 
+-------------+-------+
| employee_id | bonus |
+-------------+-------+
| 2           | 0     |
| 3           | 0     |
| 7           | 7400  |
| 8           | 0     |
| 9           | 7700  |
+-------------+-------+
"""



# Creating the Employees DataFrame
data = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}

employees_df = pd.DataFrame(data)
# Displaying the DataFrame
employees_df

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [ ]:
employees_df["bonus"] = employees_df.apply(lambda x: x["salary"] * 2 if x["employee_id"] % 2 ==1 and not x["name"].startswith("M") else 0, axis=1)
employees_df

   employee_id     name  salary  bonus
0            2     Meir    3000      0
1            3  Michael    3800      0
2            7  Addilyn    7400  14800
3            8     Juan    6100      0
4            9   Kannon    7700  15400

In [ ]:
employees_df[["employee_id","bonus"]].sort_values(by="employee_id")

   employee_id  bonus
0            2      0
1            3      0
2            7  14800
3            8      0
4            9  15400

In [ ]:
"""""

Write a solution to find all customers who never order anything.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Customers table:
+----+-------+
| id | name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Orders table:
+----+------------+
| id | customerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
Output: 
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+

"""
customers_data = {
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max']
}
customers_df = pd.DataFrame(customers_data)

# Creating the Orders table
orders_data = {
    'id': [1, 2],
    'customerId': [3, 1]
}
orders_df = pd.DataFrame(orders_data)

In [ ]:
df = customers_df["id"].isin(orders_df["customerId"])
df_filtered = customers_df[~df]
df_new = df_filtered["name"]
df_new.columns= ["Customers"]
df_new

1    Henry
3      Max
Name: name, dtype: object

In [ ]:
df_merged = pd.merge(customers_df,orders_df, left_on='id',right_on='customerId',how='left')
df_merged

   id_x   name  id_y  customerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [ ]:
df_merged = df_merged[df_merged["customerId"].isna()]
df_name = df_merged["name"]
df_name

1    Henry
3      Max
Name: name, dtype: object

In [ ]:
df_name = pd.DataFrame(df_name)
df_name

    name
1  Henry
3    Max

In [ ]:
df_merged

   id_x   name  id_y  customerId Customers
1     2  Henry   NaN         NaN     Henry
3     4    Max   NaN         NaN       Max

In [ ]:

def twoSum(nums, target):
        """"
        :type nums: List[int]
        :type target: int
        :rtype: List[int]
        Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.

        You may assume that each input would have exactly one solution, and you may not use the same element twice.

        You can return the answer in any order.

        

        Example 1:

        Input: nums = [2,7,11,15], target = 9
        Output: [0,1]
        Explanation: Because nums[0] + nums[1] == 9, we return [0, 1].
        Example 2:

        Input: nums = [3,2,4], target = 6
        Output: [1,2]
        Example 3:

        Input: nums = [3,3], target = 6
        Output: [0,1]
        """
        target_index = []
        for i in range(len(nums)-1):
            for j in range(1+i,len(nums)):
                sum_array = nums[i]+nums[j]
                if sum_array == target:
                    target_index = [i] + [j]
        return target_index

In [ ]:
""""
for this problem this is how I thought of it. 
1 - make n*n-1/2 lists of integers 
2 - add those n*n-1 lists of integers into a new array
3 - finaly sum only the integers that equal the target value
"""""

nums = [3,2,4]
target = 6

#1 
# array =[]
# for i in range(len(nums)-1):
#     for j in range(1+i,len(nums)):
#         array = [i]+[j]
# #         print(array)


# 2 
# for i in range(len(nums)-1):
#     for j in range(1+i,len(nums)):
#         sum_array = nums[i]+nums[j]
#         array.append(sum_array)


# for i in range(len(nums)-1):
#     for j in range(1+i,len(nums)):
#         sum_array = nums[i]+nums[j]
#         if sum_array == k:
#             print(list(i,j))

# target_index = []
# for i in range(len(nums)-1):
#             for j in range(1+i,len(nums)):
#                 sum_array = nums[i]+nums[j]
#                 if sum_array == target:
#                     target_index = [i]+[j]
#             print(target_index)

twoSum(nums, target)

[1, 2]

In [ ]:
def isPalindrome(x):
        """
        :type x: int
        :rtype: bool
        Given an integer x, return true if x is a 
        palindrome, and false otherwise.

        

        Example 1:

        Input: x = 121
        Output: true
        Explanation: 121 reads as 121 from left to right and from right to left.
        Example 2:

        Input: x = -121
        Output: false
        Explanation: From left to right, it reads -121. From right to left, it becomes 121-. Therefore it is not a palindrome.
        Example 3:

        Input: x = 10
        Output: false
        Explanation: Reads 01 from right to left. Therefore it is not a palindrome.
        """
        x_str = str(x)
        if x_str[::-1] == x_str:
                return True

In [ ]:
"""""
the way I thought for this question is as follows: 

when I write the integers backwords they should also equal writing normally 

there is two ways I can solve this
1 - if simpily writing it backwords equals writing it notmally by writing it into another array 

2- using pointers to check from the left and right if each pointer from the left and right equal each other 

"""

x = 1212

# 1 
# if x_str[::-1] == x_str:
#         print(True)

# 2 Try to do this
x_str = str(x)

l = 0 
r = len(x_str) - 1 
for i in range(len(x_str)):
    if x_str[l] == x_str[r]:
        l+=1 
        r-=1

In [ ]:
class Solution(object):
    def romanToInt(self, s):
        """
        :type s: str
        :rtype: int

        Roman numerals are represented by seven different symbols: I, V, X, L, C, D and M.

Symbol       Value
I             1
V             5
X             10
L             50
C             100
D             500
M             1000
For example, 2 is written as II in Roman numeral, just two ones added together. 12 is written as XII, which is simply X + II. The number 27 is written as XXVII, which is XX + V + II.

Roman numerals are usually written largest to smallest from left to right. However, the numeral for four is not IIII. Instead, the number four is written as IV. Because the one is before the five we subtract it making four. The same principle applies to the number nine, which is written as IX. There are six instances where subtraction is used:

I can be placed before V (5) and X (10) to make 4 and 9. 
X can be placed before L (50) and C (100) to make 40 and 90. 
C can be placed before D (500) and M (1000) to make 400 and 900.
Given a roman numeral, convert it to an integer.

 

Example 1:

Input: s = "III"
Output: 3
Explanation: III = 3.
Example 2:

Input: s = "LVIII"
Output: 58
Explanation: L = 50, V= 5, III = 3.
Example 3:

Input: s = "MCMXCIV"
Output: 1994
Explanation: M = 1000, CM = 900, XC = 90 and IV = 4.
        """

In [ ]:
symbols = {"I": 1, "V":5, "X":10, "L":50, "C":100, "D":500, "M":1000}

12

dict_values([1, 5, 10, 50, 100, 500, 1000])

In [ ]:
"""""
You are given an integer array nums. The unique elements of an array are
the elements that appear exactly once in the array. Write a function called
sum_unique that returns the sum of all the unique elements of nums.
Example: Input: nums = [1,2,3,2] Output: 4 Explanation: The unique
elements are [1,3], and the sum is 4.

"""""

nums = [1,2,3,2,4,4,3]

freq = {}

for num in nums:
    freq[num] = freq.get(num,0) +1

sum_num = 0
for num, count in freq.items():
    if count == 1:
        sum_num += num
sum_num

1

In [ ]:
"""""
Given an array of integers arr, a lucky integer is an integer that has
a frequency in the array equal to its value. Write a function called
lucky_integer that return the largest lucky integer in the array. If there
is no lucky integer return -1.
Example 1:
Input: arr = [2,2,3,4] Output: 2 Explanation: The only lucky number in
the array is 2 because frequency[2] == 2.
Example 2:
Input: arr = [1,2,2,3,3,3] Output: 3 Explanation: 1, 2 and 3 are all lucky
numbers, return the largest of them.

"""""


arr = [2,2,3,3,3,3,2]

def luck_integer(arr):
        freq = {}

        for integer in arr: 
            freq[integer] = freq.get(integer,0)+1 

        lucky_number = []
        for integer, count in freq.items():    
            if integer == count:
                lucky_number.append(integer)
            elif integer != count:
                 lucky_number.append(-1)
        
        max_lucky = max(lucky_number)      
                
                 
        return max_lucky

In [ ]:
luck_integer(arr)

-1

In [ ]:
"""""
Given a string s, sort it in decreasing order based on the frequency of the
characters. The frequency of a character is the number of times it appears
in the string.
Return the sorted string. If there are multiple answers, return any of
them.
Example 1:
Input: s = ”tree”
Output: ”eert”
Explanation: ’e’ appears twice while ’r’ and ’t’ both appear once.
So ’e’ must appear before both ’r’ and ’t’. Therefore ”eetr” is also a valid
answer.
Example 2:
Input: s = ”cccaaa”
Output: ”aaaccc”
Explanation: Both ’c’ and ’a’ appear three times, so both ”cccaaa” and
”aaaccc” are valid answers.
1
Note that ”cacaca” is incorrect, as the same characters must be together.
Hint: Here is how you can sort a list of tuples using the second element.
sorted(
[(’abc’, 121), (’abc’, 231), (’abc’, 148), (’abc’, 221)],
key=lambda x: x[1]
"""

s = "tree"

freq = {}

for i in s:
    freq[i] = freq.get(i, 0) +1 


new_list = sorted(freq.items(), key= lambda x: x[1], reverse= True)

new_str = ""

for char,count in new_list:
    new_str += char * count 

new_str

'eetr'

In [ ]:
nums = [1,2,3,4,5]

qubic = map(lambda x: x**3, nums)
print(list(qubic))

even = filter(lambda x: x % 2 == 0, nums)
print(list(even))

odd = filter(lambda x: x % 2 != 0, nums)
print(list(odd))

[1, 8, 27, 64, 125]
[2, 4]
[1, 3, 5]

In [ ]:
""""

Write a function called sum_odds that, given a non-negative number k returns the sum of all
odd positive numbers smaller than or equal to k
Example sum_odds(9) = 1 + 3 + 5 + 7 + 9 = 25

"""
k = 5

sum_odd = 0

for i in range(k+1):
    if i % 2 != 0:
        sum_odd += i

sum_odd

9

In [ ]:
k=11
def sum_not_even(k):
    sum_odd = filter(lambda x: x % 2 != 0, range(k+1))
    return sum(list(sum_odd))

sum_not_even(k)

36

In [ ]:
"""""
Write a function called all_even that takes a list of integers as input and returns False if any
of the numbers in the list are odd. If all numbers in the list are even, the function should return True.
Examples:
all even([2, 4, 6]) Output: True
all even([2, 3, 6])) Output: False
"""
list = [2,4,6,8]

def all_even(list):
    for i in range(len(list)):
        if list[i] % 2 ==0:
            return True
    
all_even(list)

True

In [ ]:
"""""
Write a function named freq_k_elems that takes a list of integers L and an integer k as input
and returns a list containing the elements that appear exactly k times in L.
Examples:
freq_k_elems( [1, 2, 2, 3, 3, 4, 4, 4], 2) = [2, 3]
freq_k_elems( [1, 2, 2, 3, 3, 4], 1) = [1, 4]

"""

nums=[1,2,2,3,4,4]

freq ={}

for num in nums:
    freq[num] = freq.get(num, 0) + 1


for num, count

In [ ]:
"""""

You are given a binary string s (a string containing only ”0” and ”1”).
You may choose up to one ”0” and flip it to a ”1”. What is the length of
the longest substring achievable that contains only ”1”?
For example, given s = ”1101100111”, the answer is 5. If you perform the
flip at index 2, the string becomes 1111100111.
Hint: this problem is equivalent to asking: what is the longest string than
contains just one 0.
2

"""""

s = "1101100111"

current_len = 0 
for i in range(len(s)):
    if  in s[:i]:

1
11
110
1101
11011
110110
1101100
11011001
110110011

In [ ]:
# 1 Write a function that reverses a string. The input string is given as an array of characters s. You must do this by modifying the input array in-place.

s = ['h','e','l','l','o', 'f', 'g','t','a','j','k']

left = 0
right = len(s) -1 

for i in range(len(s)):
    if i <= len(s) // 2:
        s[left], s[right] = s[right], s[left]
        left+=1 
        right-=1 
s

['k', 'j', 'a', 't', 'g', 'f', 'o', 'l', 'l', 'e', 'h']

In [ ]:
#Write a function that, given an integer array and an integer k finds a contiguous subarray of length k that has the maximum average value and returns this value.

array = [1,2,3,2,1,5]
k = 3

current_count = array[:k]
max_sum = sum(current_count)
new_array = 0

for i in range(len(array)-k+1):
    new_array = sum(array[i:k+i])
    if new_array > max_sum:
        max_sum = new_array
max_sum

8

In [ ]:
# Given an integer array nums, find all the unique numbers x in nums that satisfy the following: x + 1 is not in nums, and x - 1 is not in nums.

nums = [1,2,3,4,10,11]
array = []
for i in range(len(nums)):
    if nums[i] + 1 and nums[i] - 1 not in nums:
        array.append(nums[i])
array

[1, 10]

In [ ]:
# Given an integer array nums, return true if any value appears at least twice in the array, and return false if every element is distinct.

nums = [1,5,-2,-4,0, 0]

nums_set = list(set(nums))

if len(nums_set) == 2 and nums_set == nums:
    print(False)

if sorted(nums_set) != sorted(nums):
    print(True)
else:
    print(False)

True

In [ ]:
sorted(nums)

[-4, -2, 0, 1, 5]

In [ ]:
sorted(nums_set)

[-4, -2, 0, 1, 5]

In [ ]:
# You are given an integer array matches where matches[i] = [winneri, loseri] indicates that the player winneri defeated player loseri in a match.

[1, 2, 3, 4, 10, 11]

In [ ]:
""""""""""
Given an array of integers arr and two integers k and threshold, return the number of sub-arrays of size k and average greater than or equal to threshold.

 
Example 1:

Input: arr = [2,2,2,2,5,5,5,8], k = 3, threshold = 4
Output: 3
Explanation: Sub-arrays [2,5,5],[5,5,5] and [5,5,8] have averages 4, 5 and 6 respectively. All other sub-arrays of size 3 have averages less than 4 (the threshold).
Example 2:

Input: arr = [11,13,17,23,29,31,7,5,2,3], k = 3, threshold = 5
Output: 6
Explanation: The first 6 sub-arrays of size 3 have averages greater than 5. Note that averages are not integers.

"""

arr = [11,13,17,23,29,31,7,5,2,3]
k= 3
threshold = 4

count = 0 
for i in range(len(arr)-k+1):
    if sum(arr[i:i+k])/k >= threshold:
        count +=1 

count

7

In [ ]:
arr = [2,2,2,2,5,5,5,8]
k= 3
threshold =4


count = 0 
sub_sum = sum(arr[:k])

if sub_sum/k >= threshold:
      count +=1 

for i in range(len(arr)-k):
        sub_sum -= arr[i]
        sub_sum += arr[i+k]

        if sub_sum/k >= threshold:
            count += 1 

count

3

In [ ]:

def removeDuplicates(nums):
        """
        :type nums: List[int]
        :rtype: int

        Given an integer array nums sorted in non-decreasing order, remove the duplicates in-place such that each unique element appears only once. 
        The relative order of the elements should be kept the same. Then return the number of unique elements in nums.

        Consider the number of unique elements of nums to be k, to get accepted, you need to do the following things:

        Change the array nums such that the first k elements of nums contain the unique elements in the order they were present in nums initially. The remaining elements of nums are not important as well as the size of nums.
        Return k.
        Example 1:

        Input: nums = [1,1,2]
        Output: 2, nums = [1,2,_]
        Explanation: Your function should return k = 2, with the first two elements of nums being 1 and 2 respectively.
        It does not matter what you leave beyond the returned k (hence they are underscores).
        Example 2:

        Input: nums = [0,0,1,1,1,2,2,3,3,4]
        Output: 5, nums = [0,1,2,3,4,_,_,_,_,_]
        Explanation: Your function should return k = 5, with the first five elements of nums being 0, 1, 2, 3, and 4 respectively.
        It does not matter what you leave beyond the returned k (hence they are underscores).

        """
        k = len(list(set(nums)))
        return k,  list(set(nums))

In [ ]:
nums = [1,1,2,4,5,6,4,9,8]

nums = list(set(nums))
k = len(list(set(nums)))
print(k,  list(set(nums)))

7 [1, 2, 4, 5, 6, 8, 9]

In [ ]:
nums = [1,1,2,4,5,6,4,9,8]


for num in range(len(nums)):

(2, [1, 2])

In [ ]:
class Solution(object):
    def strStr(self, haystack, needle):
        """
        :type haystack: str
        :type needle: str
        :rtype: int
        Given two strings needle and haystack, return the index of the first occurrence of needle in haystack, or -1 if needle is not part of haystack.

 

        Example 1:
        Input: haystack = "sadbutsad", needle = "sad"
        Output: 0
        Explanation: "sad" occurs at index 0 and 6.
        The first occurrence is at index 0, so we return 0.

        Example 2:
        Input: haystack = "leetcode", needle = "leeto"
        Output: -1
        Explanation: "leeto" did not occur in "leetcode", so we return -1.
        """

In [ ]:
haysatck = 'sadbutsad'
needle = 'sad'
for i in range(len(haysatck)):
        if needle in haysatck:
            
        else:
            print(-1)

s
a
d
b
u
t
s
a
d

In [ ]:
class Solution(object):
    def searchInsert(self, nums, target):
        """
        :type nums: List[int]
        :type target: int
        :rtype: int
        Given a sorted array of distinct integers and a target value, return the index if the target is found. If not, return the index where it would be if it were inserted in order.

        You must write an algorithm with O(log n) runtime complexity.

        

        Example 1:

        Input: nums = [1,3,5,6], target = 5
        Output: 2
        Example 2:

        Input: nums = [1,3,5,6], target = 2
        Output: 1
        Example 3:

        Input: nums = [1,3,5,6], target = 7
        Output: 4
        """

In [ ]:
nums = [1,3,5,6,7]
target = 2

nums_sorted = []

for i in range(len(nums)):
    if target == nums[i]:
            print(i)

            
if target != nums[i]:          
        nums.append(target)
        nums_sorted = sorted(nums)
        for j in range(len(nums_sorted)):
               if target == nums_sorted[i]:
                      print(i)

In [ ]:
nums.append(target)
nums

[1, 3, 5, 6, 2]

In [ ]:
list1 = [1,2,3,4,5]
list2 = list1

list2[0] = 100

In [ ]:

list1 is list2

True

In [ ]:
list1 is list2

True

In [ ]:
list1 = [1,3,4,5,2]

In [ ]:
list2 in list1

False

In [ ]:
# sum values in a list 

nums = [1,2,3,4]

sum = 0
for i in range(len(nums)):
    sum += nums[i]

sum

10

In [ ]:
# find the factorial of an integer 

k = 4

factorial = 1

for i in range(1,k+1):
    factorial *= i
factorial

24

In [ ]:
quantity = [2,3,5,5]
price= [1,1,2,1]

cost = []

for i in range(len(quantity)):
    for j in range(len(price)):
        if i == j:
            cost.append(quantity[i] * price[j])

cost

[2, 3, 10, 5]

In [ ]:
cost = [price[i] * quantity[i] for i in range(len(quantity))]
cost

[2, 3, 10, 5]

In [ ]:
# traverse a list from back to forward

lis = [1,2,3,4,5,6]

print(lis[::-1])

[6, 5, 4, 3, 2, 1]

In [ ]:
"""""
Exercise 1: Split a List into Positive and Negative Numbers
Write a function that takes a list of integers and returns two lists: one with all the positive numbers and one with all the negative numbers.
"""""


nums = [1, -2, 3, -4, 5, -6, 7, -8, 9, -10]

positive = []
negative = []


for i in range(len(nums)):
    if nums[i] > 0:
        positive.append(nums[i])
    else:
        negative.append(nums[i])
print(positive, negative)

[1, 3, 5, 7, 9] [-2, -4, -6, -8, -10]

In [ ]:
"""""
Exercise 2: Split a List by a Pivot Value
Write a function that takes a list of integers and a pivot value, and returns two lists: one with all elements less than the pivot and one with all elements greater than or equal to the pivot.
"""""

nums = [10, 5, 8, 12, 15, 3, 6, 9]
pivot = 8

less_p = []
more_p = []

for i in range(len(nums)):
    if pivot > nums[i]:
        less_p.append(nums[i])

    else:
        more_p.append(nums[i])
print(list(set(less_p)),list(set(more_p)))

[3, 5, 6] [8, 9, 10, 12, 15]

In [ ]:
"""""

Exercise 3: Split a List into Two Parts
Write a function that takes a list and an integer k, and splits the list into two parts: the first part containing the first k elements, and the second part containing the rest.
"""""

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]
k = 5

first_list = []
last_list = []

first_list = nums[:k]
last_list = nums[k:]

[6, 7, 8, 9]

In [ ]:
""""
Exercise 4: Split a List by Lengths
Write a function that takes a list and a list of lengths, and splits the list into sublists of the specified lengths.
"""""
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]
lengths = [3, 3, 3]

start = 0
new_list = []
for length in lengths:
    end = start + length
    new_list.append(nums[start:end])

    start =  end

new_list

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
"""""

Exercise 5: Split a String into Words
Write a function that takes a string and splits it into a list of words. Ignore punctuation and convert all characters to lowercase.
"""""

text = "Hello, world! This is a test."
new_list = []
for i in text.split():
    new_list.append(i.lower())

new_list

['hello,', 'world!', 'this', 'is', 'a', 'test.']

In [ ]:
"""""

Exercise 6: Split a List into Chunks
Write a function that takes a list and an integer chunk_size, and splits the list into chunks of the specified size.

"""""
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]
chunk_size = 3

for i in range(0, len(nums), chunk_size):
    print(nums[i:i+chunk_size])

[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

In [ ]:
csv_content = """Name,Age,City
Alice,30,New York
Bob,25,Los Angeles
Charlie,35,Chicago"""

In [ ]:
data = [(1,85), (2,92), (3,78), (4,95), (5,68)]

threshold = 80

new_data = [ ]
for i in data:
    if i[1] < threshold:
        new_data.append(i)

new_data

[(3, 78), (5, 68)]

In [ ]:
# Exercise: filter students with Age <=30
[{'Name': 'Alice', 'Age': '30', 'City': 'New York'},
{'Name': 'Bob', 'Age': '25', 'City': 'Los Angeles'},
{'Name': 'Charlie', 'Age': '35', 'City': 'Chicago'}]

[{'Name': 'Alice', 'Age': '30', 'City': 'New York'},
 {'Name': 'Bob', 'Age': '25', 'City': 'Los Angeles'},
 {'Name': 'Charlie', 'Age': '35', 'City': 'Chicago'}]

In [ ]:
m = [[1,2,4], [1,2,3]]

zero_matrix = []

for sublist in m: 
    print(sublist)
    zero_sublist = [0] * len(sublist)

    zero_matrix.append(zero_sublist)

zero_matrix

[1, 2, 4]
[1, 2, 3]

[[0, 0, 0], [0, 0, 0]]

In [ ]:
# find first occurrance of a target in a list 

list1 = [10, 5, 20, 50, 20]
target = 20 

def firs_occurrance(list1, target):
    for i in range(len(list1)):
        if list1[i] == target:
            return i

firs_occurrance(list1, target)

2

In [ ]:
# transpose a matrix 

matrix = [[1,2,3],
          [4,5,6],
          [7,8,9]]

transposed = []

for cols in range(len(matrix)):

    new_row = []

    for row in matrix:
        new_row.append(row[cols])
    transposed.append(new_row)
transposed

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [ ]:
print(matrix[0])

[7, 8, 9]

In [ ]:
words = ["banana", "apple", "kiwi"]

sentence = ""

for word in words: 
    sentence += word.upper() + " "
sentence

'BANANA APPLE KIWI '

In [ ]:
matrix = [[1,2,3],
          [4,5,6],
          [7,8,10]]

matrix_sum = 0
for row in matrix:
    for element in row:
        matrix_sum += element
matrix_sum

46

In [ ]:
names = ["Ali", "Bera", "Kamala", "Jack"]
scores = [34,12,14,13]
result = []

for i,s in zip(names,scores):
    result.append(f'{i}: {s}')


result

['Ali: 34', 'Bera: 12', 'Kamala: 14', 'Jack: 13']

In [ ]:
"""""
Write a function that takes a list and an integer k as input.
The function should adjust the list to ensure its length is
exactly k. If the length of the list is greater than k, truncate the
list to the first k elements. If the length of the list is less than
k, pad the list with zeros until its length is k.

"""

list = [1,2]

k = 1

if len(list) >= k:
    list = list[:k]

while len(list) <k:
        list.append(0) 



    




list

[1]

In [ ]:
"""""
Repetition and concatenation
Given two lists, list1 and list2, we say "list2 divides list1" if
list1 can be formed by concatenating list2 with itself one or
more times. Write a function to check if list2 divides list1.
"""""

list1 = [1,2,3,1,2,3,1,2,3,1,2,3]
list2 = [1,2,3]


while len(list1) > len(list2):
    list2 = list2+list2

if list1 == list2:
    print(True) 
else:
    print(False)

True

In [ ]:
if len(list1) % len(list2) != 0:
    print(False)

repeat_count = len(list1) // len(list2)

if repeat_count * list2 == list1:
    print(True)
else:
    print(False)

False
False

In [ ]:
"""""
Longest common prefix
Write a function to find the longest common prefix string amongst an
array of strings. If there is no common prefix, return an empty string.
Example 1:
Input: strs = ["flower","flow","flight"]
Output: "fl"
Example 2:
Input: strs = ["dog","racecar","car"]
Output: ""
Explanation: There is no common prefix among the input strings.
"""

strs = ["flower","flow","flight"]
k=0
for i in range(len(strs)):
    for j in range(len(strs))
    if strs[i]

0
1
2

In [ ]:
strs[1]

'flow'

['__call__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__name__',
 '__ne__',
 '__new__',
 '__qualname__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__self__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__text_signature__']

In [ ]:
def my_pie():
    print(3.14)

result = my_pie()
print(result)

3.14
None

In [ ]:
def calculate(lenght, width): 
    area = lenght * width 
    perimeter = 2 * (lenght*width)

    return area, perimeter

In [ ]:
length= 5
width = 3

area, perimeter = calculate(length,width)
print(area)
print(perimeter)

15
30

In [ ]:
nums = [1,1,1,1,3,2]
sum = 0
for i in nums:
    sum += i
sum

9

In [ ]:
def search(x, data):
    index = -1 
    for i in range(len(data)):
        if data[i] ==x:
            index = i
            break
    return index

first = ['Mary', 'Xue', 'James']

search('James', first)

2

In [ ]:
global_var = 20
global_var1 = 30

global_list = [1,2,3]

def modify():
    global global_var
    global_var = 1000

def modify2():
    global_var1 = 50

def modify1():
    global_list.append(4)

In [ ]:
modify()
global_var

1000

In [ ]:
modify2()
global_var1

30

In [ ]:
list("ahndoa")

['a', 'h', 'n', 'd', 'o', 'a']

In [ ]:
def modify_list(original_list):
    local_list = original_list.copy()
    local_list.append(4)
    return local_list

my_list = [1,2,3,4,5]

new_list = modify_list(my_list)

print(my_list)
print(new_list)

[1, 2, 3, 4, 5]
[1, 2, 3, 4, 5, 4]

In [ ]:
"""""

Given an array of strings words and an integer length, return indices of
the two strings such that their concatenated length is equal to length.
Example:
words = ["hello", "world", "a", "bc"] and length = 7,
the function should return [0, 3] because the length of words[0] +
words[3] = "hello" + "bc" = 7.

"""
words = ["hello", "world", "a", "bc"] 
length = 6
new_string = ''


for i in range(len(words)):
    for j in range(i+1,len(words)):
        
        new_string = words[i] + words[j]
        if len(new_string) == length:
            print([i,j])

[0, 2]
[1, 2]

In [ ]:
dict = {}

for word in words:
    dict[len(word)] = dict.get(len(word), 0) + 1 

for value,count in dict.items():

(5, 2)
(1, 1)
(2, 1)

In [ ]:
"""""
You are given an integer array nums. The unique elements of an
array are the elements that appear exactly once in the array.
Example: 1
Input: nums = [1,2,3,2]
Output: 4
Explanation: The unique elements are [1,3], and the sum is 4.
Example 2:
Input: nums = [1,1,1,1,1]
Output: 0
Explanation: There are no unique elements, and the sum is 0.
"""""
nums = [1,2,3,2,4]


freq ={}

for num in nums:
    freq[num] = freq.get(num, 0) + 1 

count_sum = 0

for num,count in freq.items():
    if count == 1:
        count_sum += num
    else:
        count_sum
    
count_sum

8

In [ ]:
"""""

You are given an integer array
matches where matches[i] = [winner_i,
loser_i] indicates that the player
winner_i defeated player loser_i in a
match.
Return a list answer of size 2 where:
● answer[0] is a list of all players that
have not lost any matches.
● answer[1] is a list of all players that
have lost exactly one match.

"""

matches = [[1,3],[2,3],[3,6],[5,6],[5,7],[4,5],[4,8],[4,9],[10,4],[10,9]]

winner = []
loser = []

freq={}

TypeError: 'int' object is not subscriptable

In [ ]:
matches[1][0]

2

In [ ]:
"""""
Given an integer array nums, return the largest integer that only occurs once. If no
integer occurs once, return -1.
Example 1:
Input: nums = [5,7,3,9,4,9,8,3,1,11]
Output: 8
"""

freq ={}

nums = [5,7,3,9,4,9,8,3,1,11,12,12,13]

for num in nums:
    freq[num] = freq.get(num,0) + 1

largest_integer = 0
new_list = []
for num, count in freq.items():
    if count == 1:
        new_list.append(num)

max_intger = max(new_list)
        
max_intger

13

In [ ]:
"""""

You are given an array nums consisting of positive integers. You can choose two indices
i and j, such that i != j, and the sum of digits of the number nums[i] is equal to that of
nums[j].
Return the maximum value of nums[i] + nums[j] that you can obtain over all possible
indices i and j that satisfy the conditions.
Input: nums = [18,43,36,13,7]
Output: 54

"""""

nums = [18,43,36,13,7]
new_list = []

for i in range(len(nums)):
    for j in nums:
        print(j[i])

TypeError: 'int' object is not subscriptable

In [ ]:
"""""
You are given an m x n integer grid accounts where accounts[i][j] is the amount of money the i​​​​​​​​​​​th​​​​ customer has in the j​​​​​​​​​​​th​​​​ bank. Return the wealth that the richest customer has.

A customer's wealth is the amount of money they have in all their bank accounts. The richest customer is the customer that has the maximum wealth.

 

Example 1:

Input: accounts = [[1,2,3],[3,2,1]]
Output: 6
Explanation:
1st customer has wealth = 1 + 2 + 3 = 6
2nd customer has wealth = 3 + 2 + 1 = 6
Both customers are considered the richest with a wealth of 6 each, so return 6.
Example 2:

Input: accounts = [[1,5],[7,3],[3,5]]
Output: 10
Explanation: 
1st customer has wealth = 6
2nd customer has wealth = 10 
3rd customer has wealth = 8
The 2nd customer is the richest with a wealth of 10.
Example 3:

Input: accounts = [[2,8,7],[7,1,3],[1,9,5]]
Output: 17
"""

accounts = [[1,2,3],[3,2,1],[3,5,5]]
wealth = []
richest = 0 

for i in accounts:
   if sum(i) > richest:
      richest = sum(i)
richest

13

In [ ]:
"""""
You are given a 0-indexed array of strings words and a character x.

Return an array of indices representing the words that contain the character x.

Note that the returned array may be in any order.

 

Example 1:

Input: words = ["leet","code"], x = "e"
Output: [0,1]
Explanation: "e" occurs in both words: "leet", and "code". Hence, we return indices 0 and 1.
Example 2:

Input: words = ["abc","bcd","aaaa","cbc"], x = "a"
Output: [0,2]
Explanation: "a" occurs in "abc", and "aaaa". Hence, we return indices 0 and 2.
Example 3:

Input: words = ["abc","bcd","aaaa","cbc"], x = "z"
Output: []
Explanation: "z" does not occur in any of the words. Hence, we return an empty array.
 

"""
words = ["abc","bcd","aaaa","cbc"]
x = "a"
def findwords(words, x):
    word_index = []
    for index,key in enumerate(words):
            if x in key:
                word_index.append(index)

    return word_index

In [ ]:
findwords(words, x)

[0, 2]

In [ ]:
"""""
Given an array of integers nums, return the number of good pairs.

A pair (i, j) is called good if nums[i] == nums[j] and i < j.

 

Example 1:

Input: nums = [1,2,3,1,1,3]
Output: 4
Explanation: There are 4 good pairs (0,3), (0,4), (3,4), (2,5) 0-indexed.
Example 2:

Input: nums = [1,1,1,1]
Output: 6
Explanation: Each pair in the array are good.
Example 3:

Input: nums = [1,2,3]
Output: 0
"""""

nums = [1,2,3]
count = 0

for i in range(len(nums)):
    for j in range(1,len(nums)):
        if nums[i] == nums[j] and i < j:
            count += 1 
count

0

In [ ]:
new_nums.append(left[i])

[2, 3, 4, 7, 5, 3, 4, 7, 1, 3, 4, 7]

In [ ]:
nums = [2,5,1,3,4,7]
len(nums)

[2, 3, 4, 7, 5, 3, 4, 7, 1, 3, 4, 7]

In [ ]:
"""" 
Given the array nums consisting of 2n elements in the form [x1,x2,...,xn,y1,y2,...,yn].

Return the array in the form [x1,y1,x2,y2,...,xn,yn].

 

Example 1:

Input: nums = [2,5,1,3,4,7], n = 3
Output: [2,3,5,4,1,7] 
Explanation: Since x1=2, x2=5, x3=1, y1=3, y2=4, y3=7 then the answer is [2,3,5,4,1,7].
Example 2:

Input: nums = [1,2,3,4,4,3,2,1], n = 4
Output: [1,4,2,3,3,2,4,1]
Example 3:

Input: nums = [1,1,2,2], n = 2
Output: [1,2,1,2]

"""

nums = [1,4,2,5]
n = 2

left = []
right = []
new_nums = []

for i in range(0,len(nums)-n):
    left.append(nums[i])

for j in range(n,len(nums)):
        right.append(nums[j])
       

m=0
for m in range(n):
    new_nums += left[m], right[m]
    m+=1
new_nums

[1, 2, 4, 5]

In [ ]:
"""""""""
There is a programming language with only four operations and one variable X:

++X and X++ increments the value of the variable X by 1.
--X and X-- decrements the value of the variable X by 1.
Initially, the value of X is 0.

Given an array of strings operations containing a list of operations, return the final value of X after performing all the operations.

 

Example 1:

Input: operations = ["--X","X++","X++"]
Output: 1
Explanation: The operations are performed as follows:
Initially, X = 0.
--X: X is decremented by 1, X =  0 - 1 = -1.
X++: X is incremented by 1, X = -1 + 1 =  0.
X++: X is incremented by 1, X =  0 + 1 =  1.
Example 2:

Input: operations = ["++X","++X","X++"]
Output: 3
Explanation: The operations are performed as follows:
Initially, X = 0.
++X: X is incremented by 1, X = 0 + 1 = 1.
++X: X is incremented by 1, X = 1 + 1 = 2.
X++: X is incremented by 1, X = 2 + 1 = 3.
Example 3:

Input: operations = ["X++","++X","--X","X--"]
Output: 0
Explanation: The operations are performed as follows:
Initially, X = 0.
X++: X is incremented by 1, X = 0 + 1 = 1.
++X: X is incremented by 1, X = 1 + 1 = 2.
--X: X is decremented by 1, X = 2 - 1 = 1.
X--: X is decremented by 1, X = 1 - 1 = 0.
"""

operations = ["X++","++X","--X","X--"]

count = 0

for i in range(len(operations)):
    if operations[i] == "--X" or operations[i] ==  "X--":
        count -=1
    elif operations[i] == "++X" or operations[i] ==  "X++":
        count +=1 
count

0

In [ ]:
"""""
You are given an integer array nums. In one operation, you can add or subtract 1 from any element of nums.

Return the minimum number of operations to make all elements of nums divisible by 3.

 

Example 1:

Input: nums = [1,2,3,4]

Output: 3

Explanation:

All array elements can be made divisible by 3 using 3 operations:

Subtract 1 from 1.
Add 1 to 2.
Subtract 1 from 4.
Example 2:

Input: nums = [3,6,9]

Output: 0
"""

nums = [1,2,3,6,9]
count = 0

for i in range(len(nums)):
    if nums[i] % 3 != 0:
        nums[i] == nums[i] + 1 or nums[i] == nums[i] - 1
        count += 1 

count

2

In [ ]:
"""""
Given an integer array nums of length n, you want to create an array ans of length 2n where ans[i] == nums[i] and ans[i + n] == nums[i] for 0 <= i < n (0-indexed).

Specifically, ans is the concatenation of two nums arrays.

Return the array ans.

 

Example 1:

Input: nums = [1,2,1]
Output: [1,2,1,1,2,1]
Explanation: The array ans is formed as follows:
- ans = [nums[0],nums[1],nums[2],nums[0],nums[1],nums[2]]
- ans = [1,2,1,1,2,1]
Example 2:

Input: nums = [1,3,2,1]
Output: [1,3,2,1,1,3,2,1]
Explanation: The array ans is formed as follows:
- ans = [nums[0],nums[1],nums[2],nums[3],nums[0],nums[1],nums[2],nums[3]]
- ans = [1,3,2,1,1,3,2,1]

"""

nums = [1,3,2,1]

ans = []

for i in range(len(nums)):
    ans.append(nums[i])
ans = ans*2

ans

[1, 3, 2, 1, 1, 3, 2, 1]

In [ ]:
""""
Given a zero-based permutation nums (0-indexed), build an array ans of the same length where ans[i] = nums[nums[i]] for each 0 <= i < nums.length and return it.

A zero-based permutation nums is an array of distinct integers from 0 to nums.length - 1 (inclusive).

 

Example 1:

Input: nums = [0,2,1,5,3,4]
Output: [0,1,2,4,5,3]
Explanation: The array ans is built as follows: 
ans = [nums[nums[0]], nums[nums[1]], nums[nums[2]], nums[nums[3]], nums[nums[4]], nums[nums[5]]]
    = [nums[0], nums[2], nums[1], nums[5], nums[3], nums[4]]
    = [0,1,2,4,5,3]
Example 2:

Input: nums = [5,0,1,2,3,4]
Output: [4,5,0,1,2,3]
Explanation: The array ans is built as follows:
ans = [nums[nums[0]], nums[nums[1]], nums[nums[2]], nums[nums[3]], nums[nums[4]], nums[nums[5]]]
    = [nums[5], nums[0], nums[1], nums[2], nums[3], nums[4]]
    = [4,5,0,1,2,3]
"""""
nums = [0,2,1,5,3,4]
ans = []

for i in range(len(nums)):
    ans.append(nums[nums[i]])

ans

[0, 1, 2, 4, 5, 3]

In [ ]:
"""""

There are n employees in a company, numbered from 0 to n - 1. Each employee i has worked for hours[i] hours in the company.

The company requires each employee to work for at least target hours.

You are given a 0-indexed array of non-negative integers hours of length n and a non-negative integer target.

Return the integer denoting the number of employees who worked at least target hours.

 

Example 1:

Input: hours = [0,1,2,3,4], target = 2
Output: 3
Explanation: The company wants each employee to work for at least 2 hours.
- Employee 0 worked for 0 hours and didn't meet the target.
- Employee 1 worked for 1 hours and didn't meet the target.
- Employee 2 worked for 2 hours and met the target.
- Employee 3 worked for 3 hours and met the target.
- Employee 4 worked for 4 hours and met the target.
There are 3 employees who met the target.
Example 2:

Input: hours = [5,1,4,2,2], target = 6
Output: 0
Explanation: The company wants each employee to work for at least 6 hours.
There are 0 employees who met the target.
"""

hours = [5,1,4,2,2]
target = 6

count = 0 
for i in range(len(hours)):
    if hours[i] > target:
        count += 1

count

0

In [ ]:
"""""
There are n kids with candies. You are given an integer array candies, where each candies[i] represents the number of candies the ith kid has, and an integer extraCandies, denoting the number of extra candies that you have.

Return a boolean array result of length n, where result[i] is true if, after giving the ith kid all the extraCandies, they will have the greatest number of candies among all the kids, or false otherwise.

Note that multiple kids can have the greatest number of candies.

 

Example 1:

Input: candies = [2,3,5,1,3], extraCandies = 3
Output: [true,true,true,false,true] 
Explanation: If you give all extraCandies to:
- Kid 1, they will have 2 + 3 = 5 candies, which is the greatest among the kids.
- Kid 2, they will have 3 + 3 = 6 candies, which is the greatest among the kids.
- Kid 3, they will have 5 + 3 = 8 candies, which is the greatest among the kids.
- Kid 4, they will have 1 + 3 = 4 candies, which is not the greatest among the kids.
- Kid 5, they will have 3 + 3 = 6 candies, which is the greatest among the kids.
Example 2:

Input: candies = [4,2,1,1,2], extraCandies = 1
Output: [true,false,false,false,false] 
Explanation: There is only 1 extra candy.
Kid 1 will always have the greatest number of candies, even if a different kid is given the extra candy.
Example 3:

Input: candies = [12,1,12], extraCandies = 10
Output: [true,false,true]
"""""

candies = [4,2,1,1,2]
extraCandies = 1
newcandies = []
maxcandies = max(candies)
output =[]

for i in range(len(candies)):
    newcandies.append(candies[i]+extraCandies)
for j in range(len(newcandies)):
    if newcandies[j] >= maxcandies:
        output.append(True)
    else:
        output.append(False)

output

['true', 'false', 'false', 'false', 'false']

In [ ]:
"""""""""
There are n availabe seats and n students standing in a room. You are given an array seats of length n, where seats[i] is the position of the ith seat. You are also given the array students of length n, where students[j] is the position of the jth student.

You may perform the following move any number of times:

Increase or decrease the position of the ith student by 1 (i.e., moving the ith student from position x to x + 1 or x - 1)
Return the minimum number of moves required to move each student to a seat such that no two students are in the same seat.

Note that there may be multiple seats or students in the same position at the beginning.

 

Example 1:

Input: seats = [3,1,5], students = [2,7,4]
Output: 4
Explanation: The students are moved as follows:
- The first student is moved from from position 2 to position 1 using 1 move.
- The second student is moved from from position 7 to position 5 using 2 moves.
- The third student is moved from from position 4 to position 3 using 1 move.
In total, 1 + 2 + 1 = 4 moves were used.
Example 2:

Input: seats = [4,1,5,9], students = [1,3,2,6]
Output: 7
Explanation: The students are moved as follows:
- The first student is not moved.
- The second student is moved from from position 3 to position 4 using 1 move.
- The third student is moved from from position 2 to position 5 using 3 moves.
- The fourth student is moved from from position 6 to position 9 using 3 moves.
In total, 0 + 1 + 3 + 3 = 7 moves were used.
Example 3:

Input: seats = [2,2,6,6], students = [1,3,2,6]
Output: 4
Explanation: Note that there are two seats at position 2 and two seats at position 6.
The students are moved as follows:
- The first student is moved from from position 1 to position 2 using 1 move.
- The second student is moved from from position 3 to position 6 using 3 moves.
- The third student is not moved.
- The fourth student is not moved.
In total, 1 + 3 + 0 + 0 = 4 moves were used.
"""

seats = [4,1,5,9]

students = [1,3,2,6]

total = 0

c =0
for i in range(len(students)):

7
4
3
7
7

In [ ]:
"""
You are given an n x n integer matrix grid.

Generate an integer matrix maxLocal of size (n - 2) x (n - 2) such that:

maxLocal[i][j] is equal to the largest value of the 3 x 3 matrix in grid centered around row i + 1 and column j + 1.
In other words, we want to find the largest value in every contiguous 3 x 3 matrix in grid.

Return the generated matrix.

 

Example 1:


Input: grid = [[9,9,8,1],[5,6,2,6],[8,2,6,4],[6,2,2,2]]
Output: [[9,9],[8,6]]
Explanation: The diagram above shows the original matrix and the generated matrix.
Notice that each value in the generated matrix corresponds to the largest value of a contiguous 3 x 3 matrix in grid.
Example 2:


Input: grid = [[1,1,1,1,1],[1,1,1,1,1],[1,1,2,1,1],[1,1,1,1,1],[1,1,1,1,1]]
Output: [[2,2,2],[2,2,2],[2,2,2]]
Explanation: Notice that the 2 is contained within every contiguous 3 x 3 matrix in grid.

"""

grid = [[9,9,8,1],[5,6,2,6],[8,2,6,4],[6,2,2,2]]



for cols in range(len(grid)):
    rows = []
    for row in grid[:len(grid)]:
        rows.append(row[:3])
        print(rows)

[[9, 9, 8]]
[[9, 9, 8], [5, 6, 2]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6], [6, 2, 2]]
[[9, 9, 8]]
[[9, 9, 8], [5, 6, 2]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6], [6, 2, 2]]
[[9, 9, 8]]
[[9, 9, 8], [5, 6, 2]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6], [6, 2, 2]]
[[9, 9, 8]]
[[9, 9, 8], [5, 6, 2]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6]]
[[9, 9, 8], [5, 6, 2], [8, 2, 6], [6, 2, 2]]

In [ ]:
5 <   'hello'

TypeError: '<' not supported between instances of 'int' and 'str'

In [ ]:
alpha = [1, 2, 3] 
beta = alpha

beta = beta + [6, 7] 
print(alpha)
print(beta)

[1, 2, 3]
[1, 2, 3, 6, 7]

In [ ]:
10 in [5, 6, 9]

False

In [ ]:
a = set()

In [ ]:
a.add(9)

In [ ]:
a

{(1, 2, 3), (1, 2, 3, 4), 8, 9}

In [ ]:
data = ["A","B","L"]

j = 0
while j<len(data) and data[j] !="X":
    j+=1

In [ ]:
j

3

In [ ]:
total = ""

for i in data:
    total += i

In [ ]:
total

'ABL'

In [ ]:
"""""
242. Valid Anagram
Easy
Topics
Companies
Given two strings s and t, return true if t is an anagram of s, and false otherwise.

An Anagram is a word or phrase formed by rearranging the letters of a different word or phrase, typically using all the original letters exactly once.

 

Example 1:

Input: s = "anagram", t = "nagaram"
Output: true
Example 2:

Input: s = "rat", t = "car"
Output: false
"""

s = "anagram"
t = "nagaram"

dict_s ={}
dict_t ={}

for i in s:
    dict_s[i] = dict_s.get(i,0) +1 
dict_s

for j in t:
    dict_t[j] = dict_t.get(j,0) +1 

if dict_t == dict_s:
    print(True)

True

In [ ]:
""""
Given an array of strings strs, group the anagrams together. You can return the answer in any order.

An Anagram is a word or phrase formed by rearranging the letters of a different word or phrase, typically using all the original letters exactly once.

 

Example 1:

Input: strs = ["eat","tea","tan","ate","nat","bat"]
Output: [["bat"],["nat","tan"],["ate","eat","tea"]]
Example 2:

Input: strs = [""]
Output: [[""]]
Example 3:

Input: strs = ["a"]
Output: [["a"]]
"""

strs = ["eat","tea","tan","ate","nat","bat"]
dict_1 = {}
dict_2 = {}

for i in strs:
    dict_1[i] = dict_1.get(i, 0)+1 

dict_1

{'eat': 1, 'tea': 1, 'tan': 1, 'ate': 1, 'nat': 1, 'bat': 1}

In [ ]:
"""
Given an integer array nums and an integer k, return the k most frequent elements. You may return the answer in any order.

 

Example 1:

Input: nums = [1,1,1,2,2,3], k = 2
Output: [1,2]
Example 2:

Input: nums = [1], k = 1
Output: [1]
 

Constraints:

1 <= nums.length <= 105
-104 <= nums[i] <= 104
k is in the range [1, the number of unique elements in the array].
It is guaranteed that the answer is unique.
"""
nums = [1,1,1,2,2,3]

k=2
dict_k= {}

for i in nums: 
    dict_k[i] = dict_k.get(i,0)+1


sorted_items = sorted(dict_k.items(), key= lambda x: x[1], reverse= True)



k_list = [item[0] for item in sorted_items[:k]]
k_list

[1, 2]

In [ ]:
sorted_items

[(1, 3), (2, 2), (3, 1)]

3
2
1

In [ ]:
sorted_items[0]

(1, 3)

In [ ]:
dict_k.items()

dict_items([(1, 3), (2, 2), (3, 1)])

In [ ]:
"""""
Table: Employees

+-------------+------+
| Column Name | Type |
+-------------+------+
| emp_id      | int  |
| event_day   | date |
| in_time     | int  |
| out_time    | int  |
+-------------+------+
(emp_id, event_day, in_time) is the primary key (combinations of columns with unique values) of this table.
The table shows the employees' entries and exits in an office.
event_day is the day at which this event happened, in_time is the minute at which the employee entered the office, and out_time is the minute at which they left the office.
in_time and out_time are between 1 and 1440.
It is guaranteed that no two events on the same day intersect in time, and in_time < out_time.
 

Write a solution to calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Employees table:
+--------+------------+---------+----------+
| emp_id | event_day  | in_time | out_time |
+--------+------------+---------+----------+
| 1      | 2020-11-28 | 4       | 32       |
| 1      | 2020-11-28 | 55      | 200      |
| 1      | 2020-12-03 | 1       | 42       |
| 2      | 2020-11-28 | 3       | 33       |
| 2      | 2020-12-09 | 47      | 74       |
+--------+------------+---------+----------+
Output: 
+------------+--------+------------+
| day        | emp_id | total_time |
+------------+--------+------------+
| 2020-11-28 | 1      | 173        |
| 2020-11-28 | 2      | 30         |
| 2020-12-03 | 1      | 41         |
| 2020-12-09 | 2      | 27         |
+------------+--------+------------+
Explanation: 
Employee 1 has three events: two on day 2020-11-28 with a total of (32 - 4) + (200 - 55) = 173, and one on day 2020-12-03 with a total of (42 - 1) = 41.
Employee 2 has two events: one on day 2020-11-28 with a total of (33 - 3) = 30, and one on day 2020-12-09 with a total of (74 - 47) = 27.

"""""

import pandas as pd 
data = {
    "emp_id": [1, 1, 1, 2, 2],
    "event_day": ["2020-11-28", "2020-11-28", "2020-12-03", "2020-11-28", "2020-12-09"],
    "in_time": [4, 55, 1, 3, 47],
    "out_time": [32, 200, 42, 33, 74]
}

df = pd.DataFrame(data)
df

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [ ]:
df["total_time"] = df["out_time"] - df["in_time"]

df

   emp_id   event_day  in_time  out_time  total_time
0       1  2020-11-28        4        32          28
1       1  2020-11-28       55       200         145
2       1  2020-12-03        1        42          41
3       2  2020-11-28        3        33          30
4       2  2020-12-09       47        74          27

In [ ]:
df =  df.groupby(["emp_id","event_day"])["total_time"].sum().reset_index()
df= df.sort_values("event_day")
df

   emp_id   event_day  total_time
0       1  2020-11-28         173
2       2  2020-11-28          30
1       1  2020-12-03          41
3       2  2020-12-09          27

In [ ]:
df = df[["event_day", "emp_id", "total_time"]]
df

    event_day  emp_id  total_time
0  2020-11-28       1         173
2  2020-11-28       2          30
1  2020-12-03       1          41
3  2020-12-09       2          27

In [ ]:
df.columns = ["day", "emp_id", "total_time"]
df

          day  emp_id  total_time
0  2020-11-28       1         173
2  2020-11-28       2          30
1  2020-12-03       1          41
3  2020-12-09       2          27

In [ ]:
""""
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key (combination of columns with unique values) of this table.
This table shows the activity of players of some games.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on someday using some device.
 

Write a solution to find the first login date for each player.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+
Output: 
+-----------+-------------+
| player_id | first_login |
+-----------+-------------+
| 1         | 2016-03-01  |
| 2         | 2017-06-25  |
| 3         | 2016-03-02  |
+-----------+-------------
"""""
# Creating the DataFrame
data = {
    "player_id": [1, 1, 2, 3, 3],
    "device_id": [2, 2, 3, 1, 4],
    "event_date": ["2016-03-01", "2016-05-02", "2017-06-25", "2016-03-02", "2018-07-03"],
    "games_played": [5, 6, 1, 0, 5]
}

df = pd.DataFrame(data)

df

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [ ]:
df["event_date"] = pd.to_datetime(df["event_date"])
df.dtypes

player_id                int64
device_id                int64
event_date      datetime64[ns]
games_played             int64
dtype: object

In [ ]:
df = df.groupby("player_id")["event_date"].min().reset_index()

In [ ]:
df.columns = ["player_id", "first_login"]
df

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

In [ ]:
""""
+-------------+------+
| Column Name | Type |
+-------------+------+
| teacher_id  | int  |
| subject_id  | int  |
| dept_id     | int  |
+-------------+------+
(subject_id, dept_id) is the primary key (combinations of columns with unique values) of this table.
Each row in this table indicates that the teacher with teacher_id teaches the subject subject_id in the department dept_id.
 

Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

The result format is shown in the following example.

 

Example 1:

Input: 
Teacher table:
+------------+------------+---------+
| teacher_id | subject_id | dept_id |
+------------+------------+---------+
| 1          | 2          | 3       |
| 1          | 2          | 4       |
| 1          | 3          | 3       |
| 2          | 1          | 1       |
| 2          | 2          | 1       |
| 2          | 3          | 1       |
| 2          | 4          | 1       |
+------------+------------+---------+
Output:  
+------------+-----+
| teacher_id | cnt |
+------------+-----+
| 1          | 2   |
| 2          | 4   |
+------------+-----+
Explanation: 
Teacher 1:
  - They teach subject 2 in departments 3 and 4.
  - They teach subject 3 in department 3.
Teacher 2:
  - They teach subject 1 in department 1.
  - They teach subject 2 in department 1.
  - They teach subject 3 in department 1.
  - They teach subject 4 in department 1.

  """
  
# Creating the DataFrame
data = {
    "teacher_id": [1, 1, 1, 2, 2, 2, 2],
    "subject_id": [2, 2, 3, 1, 2, 3, 4],
    "dept_id": [3, 4, 3, 1, 1, 1, 1]
}

df = pd.DataFrame(data)

df

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [ ]:
df = df.groupby("teacher_id")["subject_id"].nunique().reset_index()
df

   teacher_id  subject_id
0           1           2
1           2           4

In [ ]:
df.columns = ["teacher_id", "cnt"]

In [ ]:
""""

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| student     | varchar |
| class       | varchar |
+-------------+---------+
(student, class) is the primary key (combination of columns with unique values) for this table.
Each row of this table indicates the name of a student and the class in which they are enrolled.
 

Write a solution to find all the classes that have at least five students.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Courses table:
+---------+----------+
| student | class    |
+---------+----------+
| A       | Math     |
| B       | English  |
| C       | Math     |
| D       | Biology  |
| E       | Math     |
| F       | Computer |
| G       | Math     |
| H       | Math     |
| I       | Math     |
+---------+----------+
Output: 
+---------+
| class   |
+---------+
| Math    |
+---------+
Explanation: 
- Math has 6 students, so we include it.
- English has 1 student, so we do not include it.
- Biology has 1 student, so we do not include it.
- Computer has 1 student, so we do not include it.

"""

data = {
    "student": ["A", "B", "C", "D", "E", "F", "G", "H", "I"],
    "class": ["Math", "English", "Math", "Biology", "Math", "Computer", "Math", "Math", "Math"]
}

df = pd.DataFrame(data)

df

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [ ]:
result = df.groupby("class")["student"].count().reset_index()
result

      class  student
0   Biology        1
1  Computer        1
2   English        1
3      Math        6

In [ ]:
filtered_result = result[result["student"] >= 5 ][["class"]]
filtered_result

  class
3  Math

In [ ]:

"""""
Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| 200                    |
+------------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| null                   |
+------------------------+

"""

import pandas as pd 
# Creating the Employee DataFrame
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

employee_df = pd.DataFrame(data)
employee_df

   id  salary
0   1     100
1   2     200
2   3     300

In [ ]:
employee_df = employee_df.sort_values("salary", ascending=False)
df = employee_df["salary"][1:2].reset_index()
df = df[["salary"]]
df

   salary
0     200